Tasks/ПересогласованиеКомпозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ПересогласованиеКомпозиции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторКомпозиции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конструктор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоГотово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерПроектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерРабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финдиректор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/ПересогласованиеКомпозиции/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Заголовок 	= ПолучитьЗаголовок();
КонецПроцедуры

Функция ПолучитьЗаголовок() Экспорт 
	Возврат Строка(ОбъектТЗ) + ".Пересогласование";	
КонецФункции // ПолучитьЗаголовок()

Процедура ПриВыполнении(Отказ)
	
	ДополнительныеСвойстваЗадачи = Новый СписокЗначений;
	ДополнительныеСвойстваЗадачи.Добавить("НеПроверятьОбобщеность", Истина);
	
	
	стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(ОбъектТЗ, Проект); 
	стПараметры.Вставить("Статус", 		Перечисления.СтатусыЗадач.Редакция);
	стПараметры.Вставить("Состояние", 	Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	стПараметры.Вставить("ТипЗадачи", 	Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором);
	
	омЗадачиПКДСервер.СоздатьЗадачуПКД(ОбъектТЗ, омСотрудники.ПолучитьПользователяПоСотруднтку(КонструкторКомпозиции), стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
	омКонструктор.ИзменитьКонструктораНаСервере(ОбъектТЗ, КонструкторКомпозиции);
	
	Для каждого ТекущийКомплект Из Комплекты Цикл
		
		стПараметры.ОбобщеннаяЗадача = КонструкторКомпозиции = ТекущийКомплект.Конструктор;
		омЗадачиПКДСервер.СоздатьЗадачуПКД(ТекущийКомплект.Комплект, ТекущийКомплект.Конструктор, стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
		омКонструктор.ИзменитьКонструктораНаСервере(ТекущийКомплект.Комплект, омСотрудники.ПолучитьПользователяПоСотруднтку(ТекущийКомплект.Конструктор));
		
	КонецЦикла;
	
	
КонецПроцедуры
